import numpy as np

# Главный объект библиотеки NumPy — массив. Создаётся сл.образом:
a = np.array([1, 2, 3])
a2 = np.array([[1, 2, 3], [4, 5, 6]])
a3 = np.array([[[1, 2, 3], [4, 5, 6]], [[7, 8, 9], [10, 11, 12]]])
print('a: ', a)
print()
print('a2: ',a2)
print()
print(a3)
"&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&"
#  можем узнать размерность массива
b = np.array([1,2,3])
b1 = np.array([[1, 2, 3], [4, 5, 6]])
print(f'array b: {b}')
print(f'размерность массива b: {b.ndim}')
print(f'array b1: {b1}')
print(f'размерность массива b1: {b1.ndim}')
# Доступ к элементам массива
# Есть трёхмерный массив, обращение к его элементам:
c = np.array([[[1, 2, 3], [4, 5, 6]], [[7, 8, 9], [10, 11, 12]]])
print('c: ', c )
print('c[1, 1, 1]:', c[1, 1, 1])
